---
kind: type
id: T:Autodesk.Revit.DB.ColumnAttachmentCutStyle
source: html/bf9f4c1b-976d-f0ec-9375-4ff56c621df6.htm
---
# Autodesk.Revit.DB.ColumnAttachmentCutStyle

Control the handling of columns that intersect their targets.

## Syntax (C#)
```csharp
public enum ColumnAttachmentCutStyle
```